-- Update branches table schema
ALTER TABLE branches ADD COLUMN IF NOT EXISTS address TEXT;
ALTER TABLE branches ADD COLUMN IF NOT EXISTS phone_number TEXT;
ALTER TABLE branches ADD COLUMN IF NOT EXISTS opening_time TIME DEFAULT '10:00:00.000';
ALTER TABLE branches ADD COLUMN IF NOT EXISTS closing_time TIME DEFAULT '22:00:00.000';

-- Insert branches
DELETE FROM branches;
INSERT INTO branches (name, whatsapp_number, latitude, longitude, address, phone_number, is_active, opening_time, closing_time) VALUES
('فرع الرحاب', '201050005701', 30.055863700, 31.491369100, 'السوق التجاري الأول، بجوار مكتبة الأوائل، مدينة الرحاب، القاهرة', '01050005701', true, '10:00:00.000', '23:59:00.000'),
('فرع المهندسين', '201050663537', 30.056319000, 31.196222000, 'شارع سوريا تقاطع شارع شهاب، أمام فندق كارولين كريون، المهندسين، الجيزة', '01029596408', true, '10:00:00.000', '23:59:00.000'),
('فرع المعادي 1', '201050663538', 29.962696000, 31.276942000, '82 شارع 9، بجوار بابا جونز، المعادي، القاهرة', '01029596408', true, '10:00:00.000', '23:59:00.000'),
('فرع المعادي 2', '201050006956', 29.964000000, 31.274000000, 'الشطر السابع، المعادي، القاهرة', '01029596408', true, '10:00:00.000', '23:59:00.000'),
('فرع مدينة نصر', '201050006929', 30.061883000, 31.345014000, 'عمارات المدفعية، أمام سيتي ستارز - بوابة 7، امتداد مكرم عبيد، مدينة نصر، القاهرة', '01029596408', true, '10:00:00.000', '23:59:00.000'),
('فرع مصر الجديدة', '201050006946', 30.100000000, 31.333300000, 'شارع الميرغني بجوار ديجاڤو، أمام نادي هليوبوليس، مصر الجديدة، القاهرة', '01000034062', true, '10:00:00.000', '23:59:00.000'),
('فرع اسكندرية', '201050663539', 31.245800000, 29.966000000, 'شارع الكازينو بجوار صيدلية العزبي، سان ستيفانو، الإسكندرية', '01029596408', true, '10:00:00.000', '23:59:00.000');
